3.liquid shock tube/KNP_mod/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     twoPhaseMixingCentralFoam;

startFrom       latestTime;//startTime;

startTime       0;

stopAt          endTime;

endTime         0.0002;

deltaT          1e-9;//2e-05;

writeControl    adjustableRunTime;

writeInterval   0.0001;

cycleWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  true;

maxCo           0.3;

maxDeltaT       2e-7;//1;

CourantType     cellCourant;

functions
{
	sample
	{
	#include "sampleDict"
	}
}

// ************************************************************************* //
